In [1]:
import sys
print(sys.version)

3.11.9 (tags/v3.11.9:de54cf5, Apr  2 2024, 10:12:12) [MSC v.1938 64 bit (AMD64)]

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
%sql mysql+mysqlconnector://root:1234@localhost/demo

In [4]:
%%sql
use database demo;

 * mysql+mysqlconnector://root:***@localhost/demo
(mysql.connector.errors.ProgrammingError) 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'database demo' at line 1
[SQL: use database demo;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
CREATE TABLE trial (
    id INT PRIMARY KEY AUTO_INCREMENT,   -- Unique ID for each row
    name VARCHAR(100) NOT NULL,          -- Name field
    age INT,                             -- Age field
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP  -- Record creation time
);

 * mysql+mysqlconnector://root:***@localhost/demo
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'trial' already exists
[SQL: CREATE TABLE trial (
    id INT PRIMARY KEY AUTO_INCREMENT,   -- Unique ID for each row
    name VARCHAR(100) NOT NULL,          -- Name field
    age INT,                             -- Age field
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP  -- Record creation time
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
%%sql 

INSERT INTO trial (name, age) 
VALUES 
('Alice', 25),
('Bob', 30),
('Charlie', 28),
('Diana', 35);

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[]

In [9]:
%%sql 
select * from trial;

 * mysql+mysqlconnector://root:***@localhost/demo
8 rows affected.

[(1, 'Alice', 25, datetime.datetime(2025, 9, 9, 13, 43, 42)),
 (2, 'Bob', 30, datetime.datetime(2025, 9, 9, 13, 43, 42)),
 (3, 'Charlie', 28, datetime.datetime(2025, 9, 9, 13, 43, 42)),
 (4, 'Diana', 35, datetime.datetime(2025, 9, 9, 13, 43, 42)),
 (5, 'Alice', 25, datetime.datetime(2025, 9, 9, 14, 26, 19)),
 (6, 'Bob', 30, datetime.datetime(2025, 9, 9, 14, 26, 19)),
 (7, 'Charlie', 28, datetime.datetime(2025, 9, 9, 14, 26, 19)),
 (8, 'Diana', 35, datetime.datetime(2025, 9, 9, 14, 26, 19))]

In [14]:
%%sql 
select name from trial where age not in (25, 30);

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[('Charlie',), ('Diana',), ('Charlie',), ('Diana',)]

case when

In [18]:
%%sql
SELECT CASE 
         WHEN 8>10 THEN 'true'
         ELSE 'false'
       END AS result;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[('false',)]

In [20]:
%%sql
select 
case
    when 8>10 then 'true'
    when 10>8 then 'yes'
    else 'false'
end as test;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[('yes',)]

In [34]:
%%sql
drop table if exists customertransactions;
CREATE TABLE customertransactions (
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customer_name VARCHAR(100),
    ip_address VARCHAR(45),
    product VARCHAR(100),
    amount DECIMAL(10,2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(50)
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
0 rows affected.

[]

In [36]:
%%sql
INSERT INTO customertransactions (id, login_device, customer_name, ip_address, product, amount, is_placed, is_viewed, transaction_status) VALUES
(1, 'Mobile', 'Alice Johnson', '192.168.1.1', 'Laptop', 1200.50, TRUE, TRUE, 'Completed'),
(2, 'Desktop', 'Bob Smith', '192.168.1.2', 'Smartphone', 800.00, FALSE, TRUE, 'Pending'),
(3, 'Tablet', 'Charlie Brown', '192.168.1.3', 'Headphones', 150.75, TRUE, FALSE, 'Cancelled'),
(4, 'Mobile', 'Diana Prince', '192.168.1.4', 'Camera', 500.00, TRUE, TRUE, 'Completed'),
(5, 'Desktop', 'Ethan Hunt', '192.168.1.5', 'Monitor', 250.00, FALSE, TRUE, 'Pending'),
(6, 'Mobile', 'Fiona Gallagher', '192.168.1.6', 'Keyboard', 75.25, TRUE, TRUE, 'Completed'),
(7, 'Tablet', 'George Clooney', '192.168.1.7', 'Mouse', 50.50, TRUE, FALSE, 'Cancelled'),
(8, 'Desktop', 'Hannah Montana', '192.168.1.8', 'Printer', 300.00, FALSE, TRUE, 'Pending'),
(9, 'Mobile', 'Ian Somerhalder', '192.168.1.9', 'Tablet', 400.00, TRUE, TRUE, 'Completed'),
(10, 'Desktop', 'Jane Doe', '192.168.1.10', 'Speakers', 120.00, FALSE, TRUE, 'Pending');

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[]

In [37]:
%%sql
SELECT * FROM customertransactions;

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[(1, 'Mobile', 'Alice Johnson', '192.168.1.1', 'Laptop', Decimal('1200.50'), 1, 1, 'Completed'),
 (2, 'Desktop', 'Bob Smith', '192.168.1.2', 'Smartphone', Decimal('800.00'), 0, 1, 'Pending'),
 (3, 'Tablet', 'Charlie Brown', '192.168.1.3', 'Headphones', Decimal('150.75'), 1, 0, 'Cancelled'),
 (4, 'Mobile', 'Diana Prince', '192.168.1.4', 'Camera', Decimal('500.00'), 1, 1, 'Completed'),
 (5, 'Desktop', 'Ethan Hunt', '192.168.1.5', 'Monitor', Decimal('250.00'), 0, 1, 'Pending'),
 (6, 'Mobile', 'Fiona Gallagher', '192.168.1.6', 'Keyboard', Decimal('75.25'), 1, 1, 'Completed'),
 (7, 'Tablet', 'George Clooney', '192.168.1.7', 'Mouse', Decimal('50.50'), 1, 0, 'Cancelled'),
 (8, 'Desktop', 'Hannah Montana', '192.168.1.8', 'Printer', Decimal('300.00'), 0, 1, 'Pending'),
 (9, 'Mobile', 'Ian Somerhalder', '192.168.1.9', 'Tablet', Decimal('400.00'), 1, 1, 'Completed'),
 (10, 'Desktop', 'Jane Doe', '192.168.1.10', 'Speakers', Decimal('120.00'), 0, 1, 'Pending')]

In [41]:
%%sql
select * from customertransactions limit 2;

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, 'Mobile', 'Alice Johnson', '192.168.1.1', 'Laptop', Decimal('1200.50'), 1, 1, 'Completed'),
 (2, 'Desktop', 'Bob Smith', '192.168.1.2', 'Smartphone', Decimal('800.00'), 0, 1, 'Pending')]

In [40]:
%%sql 
select customer_name, product, amount,
case 
    when amount>1000 then 'high spend'
    when amount between 500 and 1000 then 'medium spend'
    else 'low spend'
end as spend_category
from customertransactions

 * mysql+mysqlconnector://root:***@localhost/demo
10 rows affected.

[('Alice Johnson', 'Laptop', Decimal('1200.50'), 'high spend'),
 ('Bob Smith', 'Smartphone', Decimal('800.00'), 'medium spend'),
 ('Charlie Brown', 'Headphones', Decimal('150.75'), 'low spend'),
 ('Diana Prince', 'Camera', Decimal('500.00'), 'medium spend'),
 ('Ethan Hunt', 'Monitor', Decimal('250.00'), 'low spend'),
 ('Fiona Gallagher', 'Keyboard', Decimal('75.25'), 'low spend'),
 ('George Clooney', 'Mouse', Decimal('50.50'), 'low spend'),
 ('Hannah Montana', 'Printer', Decimal('300.00'), 'low spend'),
 ('Ian Somerhalder', 'Tablet', Decimal('400.00'), 'low spend'),
 ('Jane Doe', 'Speakers', Decimal('120.00'), 'low spend')]

null handling

In [42]:
%%sql
CREATE TABLE customers (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100) NULL,
    email VARCHAR(100) NULL,
    phone_number VARCHAR(20) NULL,
    address VARCHAR(100) NULL,
    amount DECIMAL(10,2) NULL
);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [43]:
%%sql
INSERT INTO customers (id, customer_name, email, phone_number, address, amount) VALUES
(1, 'Alice Johnson', 'alice@example.com', '9876543210', 'Chennai', 1200.50),
(2, 'Bob Smith', NULL, '9123456780', 'Bangalore', 800.00),
(3, NULL, 'charlie@example.com', NULL, 'Chennai', NULL),
(4, 'Diana Prince', 'diana@example.com', '9988776655', NULL, 500.00),
(5, 'Ethan Hunt', NULL, NULL, 'Bangalore', NULL);

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[]

In [44]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice Johnson', 'alice@example.com', '9876543210', 'Chennai', Decimal('1200.50')),
 (2, 'Bob Smith', None, '9123456780', 'Bangalore', Decimal('800.00')),
 (3, None, 'charlie@example.com', None, 'Chennai', None),
 (4, 'Diana Prince', 'diana@example.com', '9988776655', None, Decimal('500.00')),
 (5, 'Ethan Hunt', None, None, 'Bangalore', None)]

In [46]:
%%sql
select count(*) from customers where phone_number is null;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(2,)]

In [47]:
%%sql 
select count(*) from customers where phone_number is not null;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(3,)]

In [54]:
%%sql
SELECT id,customer_name,email,phone_number,address
from customers 
where 
    email is null
    or phone_number is null
    or address is null;

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[(2, 'Bob Smith', None, '9123456780', 'Bangalore'),
 (3, None, 'charlie@example.com', None, 'Chennai'),
 (4, 'Diana Prince', 'diana@example.com', '9988776655', None),
 (5, 'Ethan Hunt', None, None, 'Bangalore')]

In [55]:
%%sql
SELECT id,customer_name,email,phone_number,address
from customers 
where 
    email is null
    and phone_number is null
    and address is null;

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [56]:
%%sql
SELECT id,customer_name,email,phone_number,address
from customers 
where 
    email is null
    and phone_number is null;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(5, 'Ethan Hunt', None, None, 'Bangalore')]

In [58]:
%%sql
SELECT id,customer_name,amount,
coalesce(amount,'0.00')
from customers

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice Johnson', Decimal('1200.50'), '1200.50'),
 (2, 'Bob Smith', Decimal('800.00'), '800.00'),
 (3, None, None, '0.00'),
 (4, 'Diana Prince', Decimal('500.00'), '500.00'),
 (5, 'Ethan Hunt', None, '0.00')]

string handling

In [59]:
%%sql
select * from customers;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Alice Johnson', 'alice@example.com', '9876543210', 'Chennai', Decimal('1200.50')),
 (2, 'Bob Smith', None, '9123456780', 'Bangalore', Decimal('800.00')),
 (3, None, 'charlie@example.com', None, 'Chennai', None),
 (4, 'Diana Prince', 'diana@example.com', '9988776655', None, Decimal('500.00')),
 (5, 'Ethan Hunt', None, None, 'Bangalore', None)]

In [70]:
%%sql

select
length(customer_name) as name_length,
upper(address) as upper_city,
lower(customer_name) as lower_name,
concat(customer_name,'-',address,'-','TN') as name_c,
substring(customer_name,1,3) as name_sub,
trim('   chennai   ') as trimmed_city,
lpad(address,10,'*') as padded_address,
rpad(address,10,'#') as rpad_address,
replace(customer_name,' ','_') as updated_name,
instr(customer_name,'a') as position_a

from customers

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(13, 'CHENNAI', 'alice johnson', 'Alice Johnson-Chennai-TN', 'Ali', 'chennai', '***Chennai', 'Chennai###', 'Alice_Johnson', 1),
 (9, 'BANGALORE', 'bob smith', 'Bob Smith-Bangalore-TN', 'Bob', 'chennai', '*Bangalore', 'Bangalore#', 'Bob_Smith', 0),
 (None, 'CHENNAI', None, None, None, 'chennai', '***Chennai', 'Chennai###', None, None),
 (12, None, 'diana prince', None, 'Dia', 'chennai', None, None, 'Diana_Prince', 3),
 (10, 'BANGALORE', 'ethan hunt', 'Ethan Hunt-Bangalore-TN', 'Eth', 'chennai', '*Bangalore', 'Bangalore#', 'Ethan_Hunt', 4)]